# ------------------------------------------------------------------------------
# 変数（入力パラメータ）の出力
# ------------------------------------------------------------------------------
output "instance_type" {
  description = "EC2インスタンスタイプ"
  value       = var.instance_type
}

# ------------------------------------------------------------------------------
# リソース情報の出力（実用的な値）
# ------------------------------------------------------------------------------

output "ec2_public_ip" {
  description = "WebサーバーのパブリックIPアドレス"
  value       = aws_instance.web.public_ip
}

output "rds_endpoint" {
  description = "RDS接続エンドポイント"
  value       = aws_db_instance.db.endpoint
}